src/cf/Documents/Tickets.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Tickets</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.TurnoverByEmployeeLimits</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TypeOfLimits</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Count</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Canceled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StageOfLimit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Tickets/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

#Region EventHandlers

Procedure Filling(FillingData, StandardProcessing) Export

	If FillingData = Undefined Then // Create a new item.
		_DemoStandardSubsystems.OnEnterNewItemFillCompany(ThisObject, "Entity");
	EndIf;

EndProcedure // Filling()

Procedure FillCheckProcessing(Cancel, CheckedAttributes)

	If ValueIsFilled(TypeOfLimits) Then
		TypeOfLimitOneTime = Common.ObjectAttributeValue(TypeOfLimits, "OneTime");
	Else
		TypeOfLimitOneTime = True;
	EndIf;

	If Not TypeOfLimitOneTime Then
		Ind = CheckedAttributes.Find("StageOfLimit");
		If Ind = Undefined Then
			CheckedAttributes.Add("StageOfLimit");
		EndIf;
	EndIf;

EndProcedure // FillCheckProcessing() 

Procedure Posting(Cancel, PostingMode)

	// Initialization of additional properties for document posting.
	DocumentPosting.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);

	// Initialization of document data.
	LimitsForEmployeesServer.DataInitializationDocument(Ref, AdditionalProperties);

	// Prepare recordsets.
	DocumentPosting.PrepareRecordSetsForRecording(ThisObject);

	// Reflect in accounting sections.
	LimitsForEmployeesServer.ReflectRecordsByEmployeeLimits(AdditionalProperties, RegisterRecords, Cancel);

	// Write recordsets.
	DocumentPosting.WriteRecordSets(ThisObject);

	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();

EndProcedure

Procedure OnSetNewNumber(StandardProcessing, Prefix)

	Prefix = "A";

EndProcedure

#EndRegion
